/****************************************************
--------------------------------
    ----------------------------
    文件名称：Single
    作者：邹建
    创建日期：2020年08月05日 10:52:16
    ----------------------------
    ----------------------------
    修改次数：0
    修改人员：
    修改日期：
    ----------------------------
    ----------------------------
    功能描述：泛型单例
    ----------------------------
--------------------------------
*****************************************************/

namespace Assets.ZFrame.Single {
    public class Single<T> where T : new() {
        private static T instance;

        public static T Instance {
            get {
                if ( instance == null )
                    instance = new T( );
                return instance;
            }
        }
    }
}